from odoo import api, fields, models


class AccountMove(models.Model):
    _inherit = 'account.move'

    center_invoice = fields.Selection(
        [
            ('jadda', "الفرع الرئيسى جدة"),
            ('reyad', "فرع الرياض"),
            ('khobaraa', "فرع الخبراء")
        ],
        store=True,
    )
    branch_invoice = fields.Selection(
        [
            ('1', "الامانه لجديده"),
            ('2', "برج تطوير 1 الدور 5"),
            ('3', "برج تطوير 1 الدور 6"),
            ('4', "برج تطوير 1 الدور 8"),
            ('5', " برج تطوير 2 الدور 8"),
            ('6', "برج تطوير 2 الدور 9"),
            ('7', "برج توازن 4 ادوار - تحكم"),
            ('8', "برج توارن الدور 8 - تحكم"),
            ('9', "برج توارن فيلا توارن - تحكم"),
            ('10', "عبداللطيف جميل مبني العروبه - تحكم"),
            ('11', "نموذج الاعمال"),
            ('12', "وزارة الطاقة سنتر ليسن فالي"),
            ('13', "سنتر الخبر - الرزيزا ")
        ],
        store=True,
    )
